In [4]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
ser1 = Series(['One', 'Two',np.nan, 'Four'])

In [6]:
ser1

0     One
1     Two
2     NaN
3    Four
dtype: object

In [8]:
ser1.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [10]:
ser1.dropna()

0     One
1     Two
3    Four
dtype: object

In [11]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan],[np.nan,np.nan,np.nan,np.nan]])

In [12]:
dframe

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  NaN  5.0  6.0 NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [13]:
cleanframe = dframe.dropna()

In [15]:
cleanframe

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [18]:
dframe.dropna(how ='all')

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  NaN  5.0  6.0 NaN
2  7.0  NaN  NaN NaN

In [21]:
dframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [24]:
dframe2 = DataFrame(np.arange(16).reshape(4,4))

In [25]:
dframe2

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [27]:
dframe1 = DataFrame([[1,2,3,np.nan],[2,np.nan,5,6],[np.nan,7,np.nan,9],[1,np.nan,np.nan,np.nan]])

In [29]:
dframe1

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [32]:
dframe1.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [33]:
dframe1.dropna(thresh= 3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [34]:
dframe1

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [36]:
dframe1.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [37]:
dframe1.fillna({0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [40]:
dframe1.fillna(0, inplace =True)

In [41]:
dframe1

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0